server/app/controllers/pie_data_controller.rb

  def index
    date = Date.parse('2009-12-13')
    @pie_data = PieData.find_by_type('referrer',date)
---
SELECT * FROM `pie_datas` WHERE (data_type = 'referrer' AND data_date = DATE('2009-12-13')) ORDER BY category asc